{
  "_commit_hash": null,
  "activation_function": "relu",
  "architectures": [
    "Mask2FormerForUniversalSegmentation"
  ],
  "backbone_config": {
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "attention_probs_dropout_prob": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "diversity_penalty": 0.0,
    "do_sample": false,
    "drop_path_rate": 0.3,
    "early_stopping": false,
    "embed_dim": 128,
    "encoder_no_repeat_ngram_size": 0,
    "encoder_stride": 32,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1024,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-05,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "no_repeat_ngram_size": 0,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_channels": 3,
    "num_heads": [
      4,
      8,
      16,
      32
    ],
    "num_layers": 4,
    "num_return_sequences": 1,
    "out_features": [
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 4,
    "path_norm": true,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_bias": true,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "stage_names": [
      "stem",
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "transformers_version": "4.26.0.dev0",
    "typical_p": 1.0,
    "use_absolute_embeddings": false,
    "use_bfloat16": false,
    "window_size": 12
  },
  "class_weight": 2.0,
  "common_stride": 4,
  "decoder_layers": 10,
  "dice_weight": 5.0,
  "dim_feedforward": 2048,
  "dropout": 0.0,
  "encoder_feedforward_dim": 1024,
  "encoder_layers": 6,
  "enforce_input_proj": false,
  "enforce_input_projection": false,
  "feature_size": 256,
  "feature_strides": [
    4,
    8,
    16,
    32
  ],
  "hidden_dim": 256,
  "id2label": {
    "0": "person",
    "1": "bicycle",
    "2": "car",
    "3": "motorcycle",
    "4": "airplane",
    "5": "bus",
    "6": "train",
    "7": "truck",
    "8": "boat",
    "9": "traffic light",
    "10": "fire hydrant",
    "11": "stop sign",
    "12": "parking meter",
    "13": "bench",
    "14": "bird",
    "15": "cat",
    "16": "dog",
    "17": "horse",
    "18": "sheep",
    "19": "cow",
    "20": "elephant",
    "21": "bear",
    "22": "zebra",
    "23": "giraffe",
    "24": "backpack",
    "25": "umbrella",
    "26": "handbag",
    "27": "tie",
    "28": "suitcase",
    "29": "frisbee",
    "30": "skis",
    "31": "snowboard",
    "32": "sports ball",
    "33": "kite",
    "34": "baseball bat",
    "35": "baseball glove",
    "36": "skateboard",
    "37": "surfboard",
    "38": "tennis racket",
    "39": "bottle",
    "40": "wine glass",
    "41": "cup",
    "42": "fork",
    "43": "knife",
    "44": "spoon",
    "45": "bowl",
    "46": "banana",
    "47": "apple",
    "48": "sandwich",
    "49": "orange",
    "50": "broccoli",
    "51": "carrot",
    "52": "hot dog",
    "53": "pizza",
    "54": "donut",
    "55": "cake",
    "56": "chair",
    "57": "couch",
    "58": "potted plant",
    "59": "bed",
    "60": "dining table",
    "61": "toilet",
    "62": "tv",
    "63": "laptop",
    "64": "mouse",
    "65": "remote",
    "66": "keyboard",
    "67": "cell phone",
    "68": "microwave",
    "69": "oven",
    "70": "toaster",
    "71": "sink",
    "72": "refrigerator",
    "73": "book",
    "74": "clock",
    "75": "vase",
    "76": "scissors",
    "77": "teddy bear",
    "78": "hair drier",
    "79": "toothbrush",
    "80": "banner",
    "81": "blanket",
    "82": "bridge",
    "83": "cardboard",
    "84": "counter",
    "85": "curtain",
    "86": "door-stuff",
    "87": "floor-wood",
    "88": "flower",
    "89": "fruit",
    "90": "gravel",
    "91": "house",
    "92": "light",
    "93": "mirror-stuff",
    "94": "net",
    "95": "pillow",
    "96": "platform",
    "97": "playingfield",
    "98": "railroad",
    "99": "river",
    "100": "road",
    "101": "roof",
    "102": "sand",
    "103": "sea",
    "104": "shelf",
    "105": "snow",
    "106": "stairs",
    "107": "tent",
    "108": "towel",
    "109": "wall-brick",
    "110": "wall-stone",
    "111": "wall-tile",
    "112": "wall-wood",
    "113": "water-other",
    "114": "window-blind",
    "115": "window-other",
    "116": "tree-merged",
    "117": "fence-merged",
    "118": "ceiling-merged",
    "119": "sky-other-merged",
    "120": "cabinet-merged",
    "121": "table-merged",
    "122": "floor-other-merged",
    "123": "pavement-merged",
    "124": "mountain-merged",
    "125": "grass-merged",
    "126": "dirt-merged",
    "127": "paper-merged",
    "128": "food-other-merged",
    "129": "building-other-merged",
    "130": "rock-merged",
    "131": "wall-other-merged",
    "132": "rug-merged"
  },
  "ignore_value": 255,
  "importance_sample_ratio": 0.75,
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "label2id": {
    "airplane": 4,
    "apple": 47,
    "backpack": 24,
    "banana": 46,
    "banner": 80,
    "baseball bat": 34,
    "baseball glove": 35,
    "bear": 21,
    "bed": 59,
    "bench": 13,
    "bicycle": 1,
    "bird": 14,
    "blanket": 81,
    "boat": 8,
    "book": 73,
    "bottle": 39,
    "bowl": 45,
    "bridge": 82,
    "broccoli": 50,
    "building-other-merged": 129,
    "bus": 5,
    "cabinet-merged": 120,
    "cake": 55,
    "car": 2,
    "cardboard": 83,
    "carrot": 51,
    "cat": 15,
    "ceiling-merged": 118,
    "cell phone": 67,
    "chair": 56,
    "clock": 74,
    "couch": 57,
    "counter": 84,
    "cow": 19,
    "cup": 41,
    "curtain": 85,
    "dining table": 60,
    "dirt-merged": 126,
    "dog": 16,
    "donut": 54,
    "door-stuff": 86,
    "elephant": 20,
    "fence-merged": 117,
    "fire hydrant": 10,
    "floor-other-merged": 122,
    "floor-wood": 87,
    "flower": 88,
    "food-other-merged": 128,
    "fork": 42,
    "frisbee": 29,
    "fruit": 89,
    "giraffe": 23,
    "grass-merged": 125,
    "gravel": 90,
    "hair drier": 78,
    "handbag": 26,
    "horse": 17,
    "hot dog": 52,
    "house": 91,
    "keyboard": 66,
    "kite": 33,
    "knife": 43,
    "laptop": 63,
    "light": 92,
    "microwave": 68,
    "mirror-stuff": 93,
    "motorcycle": 3,
    "mountain-merged": 124,
    "mouse": 64,
    "net": 94,
    "orange": 49,
    "oven": 69,
    "paper-merged": 127,
    "parking meter": 12,
    "pavement-merged": 123,
    "person": 0,
    "pillow": 95,
    "pizza": 53,
    "platform": 96,
    "playingfield": 97,
    "potted plant": 58,
    "railroad": 98,
    "refrigerator": 72,
    "remote": 65,
    "river": 99,
    "road": 100,
    "rock-merged": 130,
    "roof": 101,
    "rug-merged": 132,
    "sand": 102,
    "sandwich": 48,
    "scissors": 76,
    "sea": 103,
    "sheep": 18,
    "shelf": 104,
    "sink": 71,
    "skateboard": 36,
    "skis": 30,
    "sky-other-merged": 119,
    "snow": 105,
    "snowboard": 31,
    "spoon": 44,
    "sports ball": 32,
    "stairs": 106,
    "stop sign": 11,
    "suitcase": 28,
    "surfboard": 37,
    "table-merged": 121,
    "teddy bear": 77,
    "tennis racket": 38,
    "tent": 107,
    "tie": 27,
    "toaster": 70,
    "toilet": 61,
    "toothbrush": 79,
    "towel": 108,
    "traffic light": 9,
    "train": 6,
    "tree-merged": 116,
    "truck": 7,
    "tv": 62,
    "umbrella": 25,
    "vase": 75,
    "wall-brick": 109,
    "wall-other-merged": 131,
    "wall-stone": 110,
    "wall-tile": 111,
    "wall-wood": 112,
    "water-other": 113,
    "window-blind": 114,
    "window-other": 115,
    "wine glass": 40,
    "zebra": 22
  },
  "mask_feature_size": 256,
  "mask_weight": 5.0,
  "model_type": "mask2former",
  "no_object_weight": 0.1,
  "num_attention_heads": 8,
  "num_hidden_layers": 10,
  "num_queries": 100,
  "output_auxiliary_logits": null,
  "oversample_ratio": 3.0,
  "pre_norm": false,
  "torch_dtype": "float32",
  "train_num_points": 12544,
  "transformers_version": null,
  "use_auxiliary_loss": true
}
